cr1901/msp430g2xx/svds/msp430g2x44.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CALIBRATION_DATA</name>
      <description>Calibration Data</description>
      <baseAddress>4344</baseAddress>
      <registers>
        <register>
          <name>CALDCO_16MHZ</name>
          <description>DCOCTL  Calibration Data for 16MHz</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_16MHZ</name>
              <description>DCOCTL  Calibration Data for 16MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_16MHZ</name>
          <description>BCSCTL1 Calibration Data for 16MHz</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_16MHZ</name>
              <description>BCSCTL1 Calibration Data for 16MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALDCO_12MHZ</name>
          <description>DCOCTL  Calibration Data for 12MHz</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_12MHZ</name>
              <description>DCOCTL  Calibration Data for 12MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_12MHZ</name>
          <description>BCSCTL1 Calibration Data for 12MHz</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_12MHZ</name>
              <description>BCSCTL1 Calibration Data for 12MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALDCO_8MHZ</name>
          <description>DCOCTL  Calibration Data for 8MHz</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_8MHZ</name>
              <description>DCOCTL  Calibration Data for 8MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_8MHZ</name>
          <description>BCSCTL1 Calibration Data for 8MHz</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_8MHZ</name>
              <description>BCSCTL1 Calibration Data for 8MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALDCO_1MHZ</name>
          <description>DCOCTL  Calibration Data for 1MHz</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_1MHZ</name>
              <description>DCOCTL  Calibration Data for 1MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_1MHZ</name>
          <description>BCSCTL1 Calibration Data for 1MHz</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_1MHZ</name>
              <description>BCSCTL1 Calibration Data for 1MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER_B3</name>
      <description>Timer B3</description>
      <baseAddress>286</baseAddress>
      <registers>
        <register>
          <name>TBIV</name>
          <description>Timer B Interrupt Vector Word</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TBCTL</name>
          <description>Timer B Control</description>
          <addressOffset>98</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIFG</name>
              <description>Timer B interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TBIE</name>
              <description>Timer B interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TBCLR</name>
              <description>Timer B counter clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MC</name>
              <description>Timer B mode control 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MC_0</name>
                  <description>Timer A mode control: 0 - Stop</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MC_1</name>
                  <description>Timer A mode control: 1 - Up to CCR0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MC_2</name>
                  <description>Timer A mode control: 2 - Continous up</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MC_3</name>
                  <description>Timer A mode control: 3 - Up/Down</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID</name>
              <description>Timer B clock input divider 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID_0</name>
                  <description>Timer A input divider: 0 - /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_1</name>
                  <description>Timer A input divider: 1 - /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_2</name>
                  <description>Timer A input divider: 2 - /4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_3</name>
                  <description>Timer A input divider: 3 - /8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBSSEL</name>
              <description>Clock source 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBSSEL_0</name>
                  <description>Clock Source: TBCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBSSEL_1</name>
                  <description>Clock Source: ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBSSEL_2</name>
                  <description>Clock Source: SMCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBSSEL_3</name>
                  <description>Clock Source: INCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTL</name>
              <description>Counter lenght 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNTL_0</name>
                  <description>Counter lenght: 16 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTL_1</name>
                  <description>Counter lenght: 12 bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTL_2</name>
                  <description>Counter lenght: 10 bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTL_3</name>
                  <description>Counter lenght:  8 bit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCLGRP</name>
              <description>Timer B Compare latch load group 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBCLGRP_0</name>
                  <description>Timer B Group: 0 - individually</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_1</name>
                  <description>Timer B Group: 1 - 3 groups (1-2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_2</name>
                  <description>Timer B Group: 2 - 2 groups (1-3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_3</name>
                  <description>Timer B Group: 3 - 1 group (all)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TBCCTL0</name>
          <description>Timer B Capture/Compare Control 0</description>
          <addressOffset>100</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COV</name>
              <description>Capture/compare overflow flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT</name>
              <description>PWM Output signal if output mode 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture input signal (read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>PWM output mode: 0 - output only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>PWM output mode: 1 - set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>PWM output mode: 4 - toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>PWM output mode: 5 - Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode: 1 /Compare mode : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLLD</name>
              <description>Compare latch load source 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <description>Compare latch load sourec : 0 - immediate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <description>Compare latch load sourec : 2 - up/down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Capture sychronize</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture input select 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <description>Capture input select: 0 - CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <description>Capture input select: 1 - CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <description>Capture input select: 2 - GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <description>Capture input select: 3 - Vcc</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode 1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <description>Capture mode: 0 - disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <description>Capture mode: 1 - pos. edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <description>Capture mode: 1 - neg. edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <description>Capture mode: 1 - both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
