cr1901/msp430g2xx/svds/msp430g2x44.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65504</baseAddress>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFE4 Port 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFE6 Port 2</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>ADC10</name>
        <description>0xFFEA ADC10</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>USCIAB0TX</name>
        <description>0xFFEC USCI A0/B0 Transmit</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>USCIAB0RX</name>
        <description>0xFFEE USCI A0/B0 Receive</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIMERA1</name>
        <description>0xFFF0 Timer A CC1-2, TA</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMERA0</name>
        <description>0xFFF2 Timer A CC0</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFF4 Watchdog Timer</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIMERB1</name>
        <description>0xFFF8 Timer B CC1-2, TB</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMERB0</name>
        <description>0xFFFA Timer B CC0</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>NMI</name>
        <description>0xFFFC Non-maskable</description>
        <value>14</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
